#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/aws-iam-main/runs/run-wbY5gSwnRj4EfEyL

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy.test_policy2_arn will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy" "test_policy2_arn"  {
      + arn         = "arn:aws:iam::509042517039:policy/test-policy2"
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + path        = (known after apply)
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = (known after apply)
    }

  # module.dummy_role.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = {
                  + Action    = "sts:AssumeRole"
                  + Effect    = "Allow"
                  + Principal = {
                      + Service = "ec2.amazonaws.com"
                    }
                }
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dummy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "createdBy" = "terraform aws-iam/role"
        }
      + tags_all              = {
          + "createdBy" = "terraform aws-iam/role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.test-group.aws_iam_group.group will be created
  + resource "aws_iam_group" "group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "test-group"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.test-group.aws_iam_group_policy_attachment.policy_attachments["arn:aws:iam::509042517039:policy/test-policy"] will be created
  + resource "aws_iam_group_policy_attachment" "policy_attachments" {
      + group      = "test-group"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::509042517039:policy/test-policy"
    }

  # module.test-group2.aws_iam_group.group will be created
  + resource "aws_iam_group" "group" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "test-group2"
      + path      = "/test2/"
      + unique_id = (known after apply)
    }

  # module.test-group2.aws_iam_group_policy_attachment.policy_attachments["arn:aws:iam::509042517039:policy/test-policy2"] will be created
  + resource "aws_iam_group_policy_attachment" "policy_attachments" {
      + group      = "test-group2"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::509042517039:policy/test-policy2"
    }

  # module.test-policy.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "test policy"
      + id          = (known after apply)
      + name        = "test-policy"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "createdBy" = "terraform aws-iam/policy"
        }
      + tags_all    = {
          + "createdBy" = "terraform aws-iam/policy"
        }
    }

  # module.test-policy2.aws_iam_policy.policy will be created
  + resource "aws_iam_policy" "policy" {
      + arn         = (known after apply)
      + description = "test policy2"
      + id          = (known after apply)
      + name        = "test-policy2"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::509042517039:role/dummy-role"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "createdBy" = "terraform aws-iam/policy"
        }
      + tags_all    = {
          + "createdBy" = "terraform aws-iam/policy"
        }
    }

  # module.test-role2.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::509042517039:role/dummy-role"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "test-role2"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "createdBy" = "terraform aws-iam/role"
        }
      + tags_all              = {
          + "createdBy" = "terraform aws-iam/role"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.test-role2.aws_iam_role_policy_attachment.test-attach["arn:aws:iam::509042517039:policy/test-policy2"] will be created
  + resource "aws_iam_role_policy_attachment" "test-attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::509042517039:policy/test-policy2"
      + role       = "test-role2"
    }

  # module.test-user.aws_iam_user.user will be created
  + resource "aws_iam_user" "user" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "test-user"
      + path          = "/"
      + tags          = {
          + "createdBy" = "createdBy aws-iam/user"
        }
      + tags_all      = {
          + "createdBy" = "createdBy aws-iam/user"
        }
      + unique_id     = (known after apply)
    }

  # module.test-user.aws_iam_user_group_membership.groups_attached will be created
  + resource "aws_iam_user_group_membership" "groups_attached" {
      + groups = [
          + "test-group",
        ]
      + id     = (known after apply)
      + user   = "test-user"
    }

  # module.test-user2.aws_iam_user.user will be created
  + resource "aws_iam_user" "user" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "test-user2"
      + path          = "/test2/"
      + tags          = {
          + "createdBy" = "createdBy aws-iam/user"
        }
      + tags_all      = {
          + "createdBy" = "createdBy aws-iam/user"
        }
      + unique_id     = (known after apply)
    }

  # module.test-user2.aws_iam_user_group_membership.groups_attached will be created
  + resource "aws_iam_user_group_membership" "groups_attached" {
      + groups = [
          + "test-group2",
        ]
      + id     = (known after apply)
      + user   = "test-user2"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @honestbank-bot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Action`*